<script setup lang="ts">
definePageMeta({
  layout: 'main',
})
</script>

<template>
  <div>
    <h1
      class="text-center text-[#373737] font-medium pb-4 mb-2 text-[40px] leading-[1.2]"
    >
      National flag of the Republic of Uzbekistan
    </h1>
    <div>
      <img
        src="@/assets/images/uzb-flag.jpg"
        height="100%"
        width="100%"
        alt=""
      />
    </div>
    <p class="text-base font-medium leading-[1.2] mb-2">
      Ўзбекистон Республикасининг Давлат байроғи Ўзбекистон Республикаси давлат
      суверенитетининг рамзидир. "Ўзбекистон Республикаси Давлат байроғи
      тўғрисида"ги Қонун 1991 йил 18 ноябрда Ўзбекистон Республикаси Олий
      Кенгашининг навбатдан ташқари ўтказилган VII Сессиясида қабул қилинган.
      Давлат байроғи ва унинг рамзи бугунги Ўзбекистон сарҳадида қадимда мавжуд
      бўлган давлатлар билан тарихан боғлиқлигини англатади ҳамда республиканинг
      миллий-маданий анъаналарини ўзида мужассамлаштиради. 1. Байроқдаги мовий
      ранг – тириклик мазмуни акс этган мангу осмон ва оби-ҳаёт рамзи. Тимсоллар
      тилида бу – яхшиликни, донишмандликни, ҳалолликни, шон-шуҳрат ва садоқатни
      билдиради. Бинобарин, Амир Темур давлати байроғининг ранги ҳам мовий
      рангда эди. 2. Байроқдаги оқ ранг – муқаддас тинчлик рамзи бўлиб, у кун
      чароғонлиги ва коинот ёритқичлари билан уйғунлашиб кетади. Оқ ранг –
      поклик, беғуборлик, софликни, орзу ва ҳаёллар тозалиги, ички гўзалликка
      интилишнинг тимсоли. 3. Яшил ранг – табиатнинг янгиланиш рамзи. У кўпгина
      халқларда навқиронлик, умид ва шодумонлик тимсоли ҳисобланади. 4. Қизил
      чизиқлар – вужудимизда жўшиб оқаётган ҳаётий қудрат ирмоқларини англатади.
      5. Навқирон ярим ой тасвири бизнинг тарихий анъаналаримиз билан боғлиқ.
      Айни пайтда у қўлга киритилган мустақиллигимиз рамзи ҳам. 6. Юлдузлар
      барча учун руҳоний, илоҳий тисмол саналган. Ўзбекистон Республикаси Давлат
      байроғидаги 12 юлдуз тасвири ҳам тарихий анъаналаримиз, қадимги
      йилномамизга бевосита алоқадор. Бизнинг ўн икки юлдузга бўлган эътиборимиз
      Ўзбекистон сарҳадидаги қадимги давлатлар илмий тафаккурида нужум илми
      тараққий этганлиги билан ҳам изоҳланади. Давлат байроғимиздаги 12 юлдуз
      тасвирини ўзбек халқи маданиятининг қадимийлиги, унинг комилликка, ўз
      тупроғида саодатга интилиши рамзи сифатида тушуниш лозим.
    </p>
    <app-socials />
  </div>
</template>

<style scoped>
.social-link {
  position: relative;
  display: inline-block;
  transition: all 0.4s linear;
}

.social-link::before,
.social-link::after {
  content: '';
  position: absolute;
  box-sizing: border-box;
  width: 100%;
  height: 100%;
  left: 0;
  top: 0;
  transition: 0.4s linear;
}

.social-link:hover {
  transform: scale(0.7);
}

.social-link:hover::before {
  border-left: 2px solid;
  border-right: 2px solid;
  transform: skewX(20deg);
}

.social-link:hover::after {
  border-top: 2px solid;
  border-bottom: 2px solid;
  transform: skewY(-20deg);
}
</style>
